# BtuPerS Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..BtuPerS Property
SymbolTypeId Class See Also
---
Symbol Btu/s, indicating unit British thermal units per second.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId BtuPerS { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BtuPerS As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BtuPerS {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace